---------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\Chong An\Documents\GitHub\stata_practice\analysis\temp/02_regressions.log
  log type:  text
 opened on:  10 Jul 2017, 12:04:49

. 
. /********************** Section 2: regressions *************************/
. 
. use "`input_dir'\clean.dta", clear

. eststo: reg rank points

      Source |       SS       df       MS              Number of obs =   62829
-------------+------------------------------           F(  1, 62827) =35534.71
       Model |  1.0214e+09     1  1.0214e+09           Prob > F      =  0.0000
    Residual |  1.8059e+09 62827  28743.5586           R-squared     =  0.3613
-------------+------------------------------           Adj R-squared =  0.3613
       Total |  2.8273e+09 62828  45000.0865           Root MSE      =  169.54

------------------------------------------------------------------------------
        rank |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      points |  -.1619458   .0008591  -188.51   0.000    -.1636297    -.160262
       _cons |   458.6618   .9158707   500.79   0.000     456.8667    460.4569
------------------------------------------------------------------------------
(est1 stored)

. eststo: reg rank points i.home_state_factor

      Source |       SS       df       MS              Number of obs =   62829
-------------+------------------------------           F( 53, 62775) =  688.74
       Model |  1.0395e+09    53  19614017.8           Prob > F      =  0.0000
    Residual |  1.7877e+09 62775  28478.2555           R-squared     =  0.3677
-------------+------------------------------           Adj R-squared =  0.3672
       Total |  2.8273e+09 62828  45000.0865           Root MSE      =  168.76

-----------------------------------------------------------------------------------
             rank |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
           points |  -.1599628   .0008605  -185.89   0.000    -.1616494   -.1582762
                  |
home_state_factor |
               2  |  -53.12675   64.24372    -0.83   0.408    -179.0446    72.79106
               3  |  -53.53323   64.92458    -0.82   0.410    -180.7855    73.71905
               4  |  -73.99869   63.92019    -1.16   0.247    -199.2824    51.28501
               5  |  -80.19233   63.80624    -1.26   0.209    -205.2527    44.86802
               6  |  -33.84109   63.97713    -0.53   0.597    -159.2364    91.55421
               7  |  -88.03323   64.02061    -1.38   0.169    -213.5137    37.44728
               8  |  -68.70134   65.19167    -1.05   0.292    -196.4771    59.07444
               9  |   -84.8917   66.38902    -1.28   0.201    -215.0143    45.23091
              10  |  -76.25338   63.81931    -1.19   0.232    -201.3393    48.83259
              11  |   -14.8664   64.76396    -0.23   0.818    -141.8039    112.0711
              12  |  -69.98102   63.86187    -1.10   0.273    -195.1504    55.18836
              13  |  -35.93531   63.94338    -0.56   0.574    -161.2645    89.39383
              14  |  -30.73876   64.89625    -0.47   0.636    -157.9355      96.458
              15  |  -18.24951   64.89024    -0.28   0.779    -145.4345    108.9355
              16  |  -80.75994   63.87399    -1.26   0.206    -205.9531    44.43319
              17  |  -38.42663   64.07845    -0.60   0.549    -164.0205    87.16724
              18  |  -78.07991   64.04438    -1.22   0.223     -203.607    47.44719
              19  |  -45.98075   64.35361    -0.71   0.475    -172.1139    80.15243
              20  |  -67.99715   64.27703    -1.06   0.290    -193.9802    57.98594
              21  |  -72.34855   63.97422    -1.13   0.258    -197.7381    53.04104
              22  |  -90.36651   63.93776    -1.41   0.158    -215.6846    34.95161
              23  |  -93.13552   66.62069    -1.40   0.162    -223.7122    37.44115
              24  |  -61.54082   63.93737    -0.96   0.336    -186.8582    63.77655
              25  |  -47.44807   63.93472    -0.74   0.458    -172.7602     77.8641
              26  |  -61.77771   64.15248    -0.96   0.336    -187.5167    63.96126
              27  |  -41.40669   64.91297    -0.64   0.524    -168.6362    85.82285
              28  |   23.74464    66.3879     0.36   0.721    -106.3758     153.865
              29  |   -55.4981   63.94556    -0.87   0.385    -180.8315     69.8353
              30  |  -69.91112   65.19907    -1.07   0.284    -197.7014    57.87917
              31  |  -62.22516   64.64374    -0.96   0.336     -188.927    64.47668
              32  |  -21.54949    70.0424    -0.31   0.758    -158.8327    115.7337
              33  |  -80.75486   63.91127    -1.26   0.206    -206.0211    44.51135
              34  |   -71.2808   64.53888    -1.10   0.269    -197.7771    55.21552
              35  |  -56.60753   64.02886    -0.88   0.377    -182.1042    68.88915
              36  |  -103.0877   63.85487    -1.61   0.106    -228.2433    22.06799
              37  |  -58.68512   63.94028    -0.92   0.359    -184.0082    66.63794
              38  |  -62.07548   64.12578    -0.97   0.333    -187.7621    63.61116
              39  |  -41.60985    64.2093    -0.65   0.517    -167.4602    84.24048
              40  |  -62.66624   63.89029    -0.98   0.327    -187.8913    62.55884
              41  |  -50.85085   66.35825    -0.77   0.443    -180.9131    79.21144
              42  |  -61.74443   64.06496    -0.96   0.335    -187.3119      63.823
              43  |  -17.64841   65.39278    -0.27   0.787    -145.8184    110.5215
              44  |  -60.09064   64.07083    -0.94   0.348    -185.6696    65.48831
              45  |  -67.70709   63.82825    -1.06   0.289    -192.8106     57.3964
              46  |   -40.2614   63.93206    -0.63   0.529    -165.5684    85.04555
              47  |  -38.14604   64.09964    -0.60   0.552    -163.7814    87.48937
              48  |  -65.75225   63.94206    -1.03   0.304    -191.0788     59.5743
              49  |   60.25167   76.47364     0.79   0.431    -89.63679    210.1401
              50  |  -60.47495    63.9912    -0.95   0.345    -185.8978    64.94792
              51  |  -69.02245   64.24746    -1.07   0.283    -194.9476    56.90269
              52  |  -58.41933   66.24487    -0.88   0.378    -188.2594    71.42074
              53  |  -29.48834    78.1185    -0.38   0.706    -182.6007     123.624
                  |
            _cons |   526.0345   63.78392     8.25   0.000     401.0179    651.0511
-----------------------------------------------------------------------------------
(est2 stored)

. eststo: reg rank points i.home_state_factor i.competition_year

      Source |       SS       df       MS              Number of obs =   62829
-------------+------------------------------           F( 64, 62764) =  987.29
       Model |  1.4184e+09    64  22162092.7           Prob > F      =  0.0000
    Residual |  1.4089e+09 62764   22447.446           R-squared     =  0.5017
-------------+------------------------------           Adj R-squared =  0.5012
       Total |  2.8273e+09 62828  45000.0865           Root MSE      =  149.82

-----------------------------------------------------------------------------------
             rank |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
           points |   -.177739   .0007968  -223.05   0.000    -.1793008   -.1761772
                  |
home_state_factor |
               2  |  -106.9453   57.04344    -1.87   0.061    -218.7506      4.8599
               3  |  -108.0261   57.64664    -1.87   0.061    -221.0136    4.961374
               4  |   -130.647   56.75542    -2.30   0.021    -241.8877   -19.40626
               5  |  -131.1005   56.65438    -2.31   0.021    -242.1432    -20.0578
               6  |  -94.77434   56.80692    -1.67   0.095     -206.116    16.56732
               7  |  -139.4069   56.84441    -2.45   0.014     -250.822   -27.99175
               8  |  -113.3162   57.88451    -1.96   0.050    -226.7699     .137594
               9  |  -129.9313   58.94697    -2.20   0.028    -245.4674   -14.39511
              10  |  -127.3341    56.6661    -2.25   0.025    -238.3997    -16.2684
              11  |  -92.07147   57.50652    -1.60   0.109    -204.7844    20.64142
              12  |    -123.47   56.70404    -2.18   0.029      -234.61      -12.33
              13  |  -105.2082   56.77718    -1.85   0.064    -216.4916    6.075169
              14  |   -95.5246   57.62158    -1.66   0.097     -208.463    17.41379
              15  |  -78.90551   57.61754    -1.37   0.171     -191.836    34.02498
              16  |  -132.6065   56.71504    -2.34   0.019    -243.7681    -21.4449
              17  |  -101.3126   56.89635    -1.78   0.075    -212.8295    10.20434
              18  |  -128.9224    56.8669    -2.27   0.023    -240.3816   -17.46315
              19  |  -102.4812   57.14147    -1.79   0.073    -214.4786     9.51615
              20  |  -119.4868   57.07281    -2.09   0.036    -231.3496   -7.624004
              21  |  -128.6519   56.80348    -2.26   0.024    -239.9868   -17.31694
              22  |  -140.0477   56.77094    -2.47   0.014    -251.3188    -28.7765
              23  |   -141.341   59.15212    -2.39   0.017    -257.2793   -25.40277
              24  |  -117.5352   56.77085    -2.07   0.038    -228.8062   -6.264241
              25  |  -113.1541   56.76916    -1.99   0.046    -224.4218   -1.886457
              26  |  -116.4916   56.96331    -2.05   0.041    -228.1398   -4.843378
              27  |   -93.7726   57.63837    -1.63   0.104    -206.7439     19.1987
              28  |  -50.59461   58.94747    -0.86   0.391    -166.1318    64.94253
              29  |  -111.0931   56.77855    -1.96   0.050    -222.3792    .1929165
              30  |  -129.3265   57.89215    -2.23   0.025    -242.7952   -15.85775
              31  |  -117.1208   57.39756    -2.04   0.041    -229.6201   -4.621505
              32  |  -78.69425   62.19125    -1.27   0.206    -200.5892    43.20071
              33  |  -134.9076   56.74741    -2.38   0.017    -246.1326   -23.68252
              34  |  -129.2025   57.30503    -2.25   0.024    -241.5205   -16.88456
              35  |  -117.9886    56.8523    -2.08   0.038    -229.4192   -6.557979
              36  |  -152.0359   56.69744    -2.68   0.007    -263.1629   -40.90878
              37  |  -109.2098    56.7741    -1.92   0.054    -220.4872    2.067485
              38  |  -118.1188   56.93807    -2.07   0.038    -229.7175   -6.520092
              39  |  -108.7801   57.01334    -1.91   0.056    -220.5263    2.966134
              40  |  -119.8303   56.72936    -2.11   0.035    -231.0199   -8.640642
              41  |  -116.0232   58.91942    -1.97   0.049    -231.5053   -.5409871
              42  |  -117.3492   56.88336    -2.06   0.039    -228.8407   -5.857766
              43  |  -88.39082   58.06429    -1.52   0.128    -202.1969    25.41529
              44  |  -108.8513   56.89063    -1.91   0.056    -220.3571    2.654395
              45  |  -123.9292   56.67421    -2.19   0.029    -235.0108   -12.84766
              46  |  -107.9834    56.7672    -1.90   0.057    -219.2472    3.280424
              47  |  -102.3767   56.91605    -1.80   0.072    -213.9322    9.178894
              48  |  -123.8435   56.77562    -2.18   0.029    -235.1238   -12.56318
              49  |  -9.258452    67.9027    -0.14   0.892    -142.3479     123.831
              50  |  -123.3899   56.81877    -2.17   0.030    -234.7548   -12.02505
              51  |  -123.4072   57.04624    -2.16   0.031    -235.2179   -11.59649
              52  |  -108.4677   58.82075    -1.84   0.065    -223.7565    6.821067
              53  |  -80.08719   69.36094    -1.15   0.248    -216.0348    55.86039
                  |
 competition_year |
            2005  |   94.22045    3.21347    29.32   0.000     87.92205    100.5189
            2006  |   109.5204   3.181403    34.43   0.000     103.2848     115.756
            2007  |   114.5227   3.174523    36.08   0.000     108.3006    120.7448
            2008  |   200.3359   3.066797    65.32   0.000      194.325    206.3468
            2009  |   145.6978    3.13543    46.47   0.000     139.5524    151.8433
            2010  |   148.3966   3.130406    47.40   0.000      142.261    154.5322
            2011  |   129.0458   3.150636    40.96   0.000     122.8705     135.221
            2012  |   -44.7552    3.68406   -12.15   0.000    -51.97597   -37.53444
            2013  |  -42.96058   3.674827   -11.69   0.000    -50.16325   -35.75792
            2014  |   219.1866   3.132669    69.97   0.000     213.0466    225.3266
            2015  |   223.5467   3.204732    69.76   0.000     217.2654     229.828
                  |
            _cons |    466.068   56.69193     8.22   0.000     354.9518    577.1843
-----------------------------------------------------------------------------------
(est3 stored)

. esttab using "`output_dir'\regressions.csv", r
(note: file C:\Users\Chong An\Documents\GitHub\stata_practice\analysis\output\regressions.csv not found)
(output written to C:\Users\Chong An\Documents\GitHub\stata_practice\analysis\output\regressions.csv)

. label list statelbl
statelbl:
           1 AK
           2 AL
           3 AR
           4 AZ
           5 CA
           6 CO
           7 CT
           8 DC
           9 DE
          10 FL
          11 Foreign
          12 GA
          13 HI
          14 IA
          15 ID
          16 IL
          17 IN
          18 KS
          19 KY
          20 LA
          21 MA
          22 MD
          23 ME
          24 MI
          25 MN
          26 MO
          27 MS
          28 MT
          29 NC
          30 ND
          31 NE
          32 NH
          33 NJ
          34 NM
          35 NV
          36 NY
          37 OH
          38 OK
          39 OR
          40 PA
          41 RI
          42 SC
          43 SD
          44 TN
          45 TX
          46 Territory
          47 UT
          48 VA
          49 VT
          50 WA
          51 WI
          52 WV
          53 WY

. 
end of do-file
C:\Users\Chong An\Documents\GitHub\stata_practice\analysis\src

. /*******************************************************************************
> *       File name:              03_graphs.do
> *       Author(s):              Chong An Ong
> *       Written:        06/23/2017 (of latest version)
> *
> *       Inputs:                 clean.dta
> *       Outputs:                
> *       
> *       Description: 
> *
> * 
> *******************************************************************************/
.  
. /********************** Section 1: Preliminaries ******************************/
. 
. version 12.1

. clear all

. clear mata

. set more off

. cap log close
