---------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\Chong An\Documents\GitHub\stata_practice\analysis\temp/summary_stats.log
  log type:  text
 opened on:  23 Jun 2017, 19:53:02

. 
. /********************** Section 2: t-test on points by hill indicator *************************/
. 
. use "`input_dir'\clean.dta", clear

. ttest points, by(hill_indicator)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |   61787    717.5756    3.161073    785.7476    711.3799    723.7713
       1 |    1042    791.3321    27.03783     872.782    738.2772    844.3869
---------+--------------------------------------------------------------------
combined |   62829    718.7988    3.141016    787.3181    712.6424    724.9552
---------+--------------------------------------------------------------------
    diff |           -73.75645     24.5935               -121.9597   -25.55315
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -2.9990
Ho: diff = 0                                     degrees of freedom =    62827

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0014         Pr(|T| > |t|) = 0.0027          Pr(T > t) = 0.9986

. 
. /********************** Section 3: Output table of number of kids from each state ******************************/
. 
. tab home_state_factor

 Home_State |      Freq.     Percent        Cum.
------------+-----------------------------------
         AK |          7        0.01        0.01
         AL |        484        0.77        0.78
         AR |        194        0.31        1.09
         AZ |      1,641        2.61        3.70
         CA |     10,437       16.61       20.31
         CO |      1,153        1.84       22.15
         CT |        944        1.50       23.65
         DC |        157        0.25       23.90
         DE |         84        0.13       24.04
         FL |      6,468       10.29       34.33
    Foreign |        226        0.36       34.69
         GA |      2,880        4.58       39.27
         HI |      1,396        2.22       41.50
         IA |        199        0.32       41.81
         ID |        200        0.32       42.13
         IL |      2,492        3.97       46.10
         IN |        758        1.21       47.30
         KS |        856        1.36       48.67
         KY |        390        0.62       49.29
         LA |        451        0.72       50.00
         MA |      1,174        1.87       51.87
         MD |      1,457        2.32       54.19
         ME |         77        0.12       54.31
         MI |      1,455        2.32       56.63
         MN |      1,478        2.35       58.98
         MO |        604        0.96       59.94
         MS |        196        0.31       60.26
         MT |         84        0.13       60.39
         NC |      1,383        2.20       62.59
         ND |        156        0.25       62.84
         NE |        258        0.41       63.25
         NH |         34        0.05       63.30
         NJ |      1,763        2.81       66.11
         NM |        294        0.47       66.58
         NV |        911        1.45       68.03
         NY |      3,194        5.08       73.11
         OH |      1,432        2.28       75.39
         OK |        653        1.04       76.43
         OR |        523        0.83       77.26
         PA |      2,099        3.34       80.60
         RI |         85        0.14       80.74
         SC |        795        1.27       82.00
         SD |        137        0.22       82.22
         TN |        777        1.24       83.46
         TX |      5,093        8.11       91.56
  Territory |      1,503        2.39       93.96
         UT |        705        1.12       95.08
         VA |      1,415        2.25       97.33
         VT |         16        0.03       97.36
         WA |      1,078        1.72       99.07
         WI |        480        0.76       99.84
         WV |         89        0.14       99.98
         WY |         14        0.02      100.00
------------+-----------------------------------
      Total |     62,829      100.00

.  
. /********************** Section 4: Output table of 10 most common cities each year ******************************/
. 
. encode home_city, gen(home_city_factor)

. egen home_city_count=count(home_city_factor), by(home_city_factor competition_year)

. forvalues year=2004/2015 {
  2.         preserve
  3.                 keep if competition_year==`year'
  4.                 gsort -home_city_count, gen(city_rank)
  5.                 duplicates drop home_city, force
  6.                 drop if city_rank > 10
  7.                 keep home_city city_rank
  8.                 rename home_city _`year'
  9.                 save "`temp_dir'\\`year'.dta", replace
 10.         restore
 11. 
. }
(59122 observations deleted)

Duplicates in terms of home_city

(2510 observations deleted)
(1183 observations deleted)
(note: file C:\Users\Chong An\Documents\GitHub\stata_practice\analysis\temp\2004.dta not found)
file C:\Users\Chong An\Documents\GitHub\stata_practice\analysis\temp\2004.dta saved
(57552 observations deleted)

Duplicates in terms of home_city

(3828 observations deleted)
(1438 observations deleted)
(note: file C:\Users\Chong An\Documents\GitHub\stata_practice\analysis\temp\2005.dta not found)
file C:\Users\Chong An\Documents\GitHub\stata_practice\analysis\temp\2005.dta saved
(57282 observations deleted)

Duplicates in terms of home_city

(4078 observations deleted)
(1456 observations deleted)
(note: file C:\Users\Chong An\Documents\GitHub\stata_practice\analysis\temp\2006.dta not found)
file C:\Users\Chong An\Documents\GitHub\stata_practice\analysis\temp\2006.dta saved
(57218 observations deleted)

Duplicates in terms of home_city

(4091 observations deleted)
(1509 observations deleted)
(note: file C:\Users\Chong An\Documents\GitHub\stata_practice\analysis\temp\2007.dta not found)
file C:\Users\Chong An\Documents\GitHub\stata_practice\analysis\temp\2007.dta saved
(56072 observations deleted)

Duplicates in terms of home_city

(5132 observations deleted)
(1611 observations deleted)
(note: file C:\Users\Chong An\Documents\GitHub\stata_practice\analysis\temp\2008.dta not found)
file C:\Users\Chong An\Documents\GitHub\stata_practice\analysis\temp\2008.dta saved
(56851 observations deleted)

Duplicates in terms of home_city

(4417 observations deleted)
(1548 observations deleted)
(note: file C:\Users\Chong An\Documents\GitHub\stata_practice\analysis\temp\2009.dta not found)
file C:\Users\Chong An\Documents\GitHub\stata_practice\analysis\temp\2009.dta saved
(56801 observations deleted)

Duplicates in terms of home_city

(4432 observations deleted)
(1586 observations deleted)
(note: file C:\Users\Chong An\Documents\GitHub\stata_practice\analysis\temp\2010.dta not found)
file C:\Users\Chong An\Documents\GitHub\stata_practice\analysis\temp\2010.dta saved
(56990 observations deleted)

Duplicates in terms of home_city

(4255 observations deleted)
(1572 observations deleted)
(note: file C:\Users\Chong An\Documents\GitHub\stata_practice\analysis\temp\2011.dta not found)
file C:\Users\Chong An\Documents\GitHub\stata_practice\analysis\temp\2011.dta saved
(59832 observations deleted)

Duplicates in terms of home_city

(1900 observations deleted)
(1083 observations deleted)
(note: file C:\Users\Chong An\Documents\GitHub\stata_practice\analysis\temp\2012.dta not found)
file C:\Users\Chong An\Documents\GitHub\stata_practice\analysis\temp\2012.dta saved
(59804 observations deleted)

Duplicates in terms of home_city

(1977 observations deleted)
(1037 observations deleted)
(note: file C:\Users\Chong An\Documents\GitHub\stata_practice\analysis\temp\2013.dta not found)
file C:\Users\Chong An\Documents\GitHub\stata_practice\analysis\temp\2013.dta saved
(56445 observations deleted)

Duplicates in terms of home_city

(4960 observations deleted)
(1413 observations deleted)
(note: file C:\Users\Chong An\Documents\GitHub\stata_practice\analysis\temp\2014.dta not found)
file C:\Users\Chong An\Documents\GitHub\stata_practice\analysis\temp\2014.dta saved
(57150 observations deleted)

Duplicates in terms of home_city

(4219 observations deleted)
(1450 observations deleted)
(note: file C:\Users\Chong An\Documents\GitHub\stata_practice\analysis\temp\2015.dta not found)
file C:\Users\Chong An\Documents\GitHub\stata_practice\analysis\temp\2015.dta saved

. 
. /********************** Section 5: Output section-count by year wide dataset *******************************/
. 
. keep competition_year home_section section_count

. duplicates drop

Duplicates in terms of all variables

(62615 observations deleted)

. replace home_section="Mid_Atlantic" if home_section=="Mid-Atlantic"
(12 real changes made)

. reshape wide section_count, i(competition_year) j(home_section) s
(note: j = Caribbean Eastern Florida Foreign Hawaii Pacific Intermountain Mid_Atlantic Middle States Midwest Missouri Valley New 
> England No. California Northern Pacific Northwest So. California Southern Southwest Texas)
(note: no data for home_section == Hawaii)
(note: no data for home_section == Pacific)
(note: no data for home_section == Middle)
(note: no data for home_section == States)
(note: no data for home_section == Missouri)
(note: no data for home_section == Valley)
(note: no data for home_section == New)
(note: no data for home_section == England)
(note: no data for home_section == No.)
(note: no data for home_section == California)
(note: no data for home_section == Pacific)
(note: no data for home_section == Northwest)
(note: no data for home_section == So.)
(note: no data for home_section == California)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                      214   ->      12
Number of variables                   3   ->      12
j variable (11 values)     home_section   ->   (dropped)
xij variables:
                          section_count   ->   section_countCaribbean section_countEastern ... section_countTexas
-----------------------------------------------------------------------------

. gen Total=0

. foreach var of varlist section* {
  2.         replace `var'=0 if `var'==.
  3.         replace Total=`var'+Total
  4.         }
(0 real changes made)
(12 real changes made)
(0 real changes made)
(12 real changes made)
(0 real changes made)
(12 real changes made)
(2 real changes made)
(10 real changes made)
(0 real changes made)
(12 real changes made)
(0 real changes made)
(12 real changes made)
(0 real changes made)
(12 real changes made)
(0 real changes made)
(12 real changes made)
(0 real changes made)
(12 real changes made)
(0 real changes made)
(12 real changes made)
(0 real changes made)
(12 real changes made)

. rename *count* .*

. 
. 
. ********
. * Save *
. ********
. 
. cd "`output_dir'"
C:\Users\Chong An\Documents\GitHub\stata_practice\analysis\output

. save "section_count.dta", replace
(note: file section_count.dta not found)
file section_count.dta saved

. 
. log close
      name:  <unnamed>
       log:  C:\Users\Chong An\Documents\GitHub\stata_practice\analysis\temp/summary_stats.log
  log type:  text
 closed on:  23 Jun 2017, 19:53:05
---------------------------------------------------------------------------------------------------------------------------------
